/*********************************************************
 * Shenzhen Thistroy Bio. Ltd. Co. copyright
 * -- Created by software, DO NOT Modify
 ********************************************************/

#include "Config.h"
#include "ConfigSample.h"

CONST ConfigDefault configDefault[CFG_MAX-CFG_USER_BEGIN] = {
	{       -3856,       -32000,            0},// 垂直负向极限位置
	{         480,            0,        32000},// 垂直正向极限位置
	{         160,        -3200,         3200},// 垂直初始位置
	{       -3184,       -32000,        32000},// 清洗池上方垂直位置
	{           0,       -32000,        32000},// 清洗池清洗垂直位置
	{           0,       -32000,        32000},// 清洗池垂直极限位置
	{       -1728,       -32000,        32000},// 常温试剂区域上方垂直位置
	{           0,       -32000,        32000},// 常温试剂区域垂直极限位置
	{       -1728,       -32000,        32000},// 冷藏试剂区域上方垂直位置
	{           0,       -32000,        32000},// 冷藏试剂区域垂直极限位置
	{       -3372,       -32000,        32000},// 调度盘2#位上方垂直位置
	{           0,       -32000,        32000},// 调度盘2#位加样垂直位置
	{           0,       -32000,        32000},// 调度盘2#位垂直极限位置
	{       -1560,       -32000,        32000},// 配合抓杯手上方垂直位置
	{           0,       -32000,        32000},// 配合抓杯手垂直位置
	{           0,       -32000,        32000},// 配合抓杯手垂直极限位置
	{       -1440,       -32000,        32000},// 样本管区域上方垂直位置
	{           0,       -32000,        32000},// 样本管区域垂直极限位置
	{      -32000,       -32000,            0},// X轴负向极限位置
	{       32000,            0,        32000},// X轴正向极限位置
	{           0,        -3200,         3200},// X轴初始位置
	{      -32000,       -32000,            0},// Y轴负向极限位置
	{       32000,            0,        32000},// Y轴正向极限位置
	{           0,        -3200,         3200},// Y轴初始位置
	{        2324,       -32000,        32000},// 清洗池位置-X轴
	{        2068,       -32000,        32000},// 常温试剂调试位1-X轴
	{        2068,       -32000,        32000},// 常温试剂调试位2-X轴
	{      -18640,       -32000,        32000},// 冷藏试剂调试位1-X轴
	{      -18848,       -32000,        32000},// 冷藏试剂调试位2-X轴
	{       -1992,       -32000,        32000},// 调度盘2#-X轴
	{      -10350,       -32000,        32000},// 配合抓杯手-X轴
	{      -15248,       -32000,        32000},// 样本管区域调试位置1-X轴
	{      -15168,       -32000,        32000},// 样本管区域调试位置2-X轴
	{       -1215,       -32000,        32000},// 样本管区域调试位置3-X轴
	{        2064,       -32000,        32000},// 清洗池位置-Y轴
	{        5648,       -32000,        32000},// 常温试剂调试位1-Y轴
	{       18112,       -32000,        32000},// 常温试剂调试位2-Y轴
	{         -96,       -32000,        32000},// 冷藏试剂调试位1-Y轴
	{       16385,       -32000,        32000},// 冷藏试剂调试位2-Y轴
	{        -672,       -32000,        32000},// 调度盘2#-Y轴
	{       -3968,       -32000,        32000},// 配合抓杯手-Y轴
	{        3776,       -32000,        32000},// 样本管区域调试位置1-Y轴
	{       20832,       -32000,        32000},// 样本管区域调试位置2-Y轴
	{        3856,       -32000,        32000},// 样本管区域调试位置3-Y轴
	{          20,            0,          100},// 内壁清洗时间
	{          20,            0,          100},// 外壁清洗时间
	{          20,            0,          100},// 吸液时间
	{          20,            0,          100},// 排液时间
	{          20,            0,         3200},// 吸液前吸空气量
	{          30,            0,         3200},// 多吸液量
	{          25,            0,         3200},// 吸液后回推量
	{          10,            0,         3200},// 吸液后吸空气量
	{          10,            0,         3200},// 排液后吸空气量
	{          50,            0,         3200},// 清洗后吸空气量
	{        3200,       -32000,        32000},// 注射器负向极限位置
	{        2560,       -32000,        32000},// 注射器初始位置
	{       32000,       -32000,        32000},// 注射器正向极限位置
	{         128,            0,          516},// 1微升对应微步数
	{           0,            0,            0},// 堵针检测阈值1
	{           0,            0,            0},// 堵针检测阈值2
	{           0,            0,            0},// 堵针检测阈值3
	{           0,            0,            0},// 堵针检测阈值4
	{           0,            0,            0},// 堵针检测阈值5
	{         128,        -3200,         3200},// 检测到液面后Z轴下降步数
};
