/*********************************************************
 * Shenzhen Thistroy Bio. Ltd. Co. copyright
 * -- Created by software, DO NOT Modify
 ********************************************************/

#include "Config.h"
#include "ConfigLoad.h"

CONST ConfigDefault configDefault[CFG_MAX-CFG_USER_BEGIN] = {
	{        -400,         -400,        12000},// 垂直负向极限位置
	{       12000,         -400,        12000},// 垂直正向极限位置
	{         336,       -12000,         3200},// 垂直初始位置
	{       -8288,       -12000,         3200},// 装杯过程向上停止位置
	{           0,       -12000,         3200},// 装杯过程向下停止位置
	{           0,        -3200,         3200},// 复位位置-调度盘
	{         288,            0,         3200},// 1#孔位对准1#盘位的位置
	{        1088,            0,         3200},// 1#孔位对准2#盘位的位置
	{        1888,            0,         3200},// 1#孔位对准3#盘位的位置
	{        2688,            0,         3200},// 1#孔位对准4#盘位的位置
	{         800,            0,         3200},// 2#孔位位置与理论位置偏差
	{        1600,            0,         3200},// 3#孔位位置与理论位置偏差
	{        2400,            0,         3200},// 4#孔位位置与理论位置偏差
};
