/*********************************************************
 * Shenzhen Thistroy Bio. Ltd. Co. copyright
 * -- Created by software, DO NOT Modify
 ********************************************************/

#include "Config.h"
#include "ConfigGrab.h"

CONST ConfigDefault configDefault[CFG_MAX-CFG_USER_BEGIN] = {
	{      -32000,       -32500,            0},// 垂直负向极限位置
	{       32000,            0,        32000},// 垂直正向极限位置
	{         436,        -3200,         3200},// 垂直初始位置
	{         544,       -32000,        32000},// 混匀高度垂直位置
	{           0,            0,            0},// 放杯位置相对抓杯位置高度差
	{       -1200,       -32000,        32000},// 光学测量位抓杯垂直位置
	{           0,       -32000,        32000},// 光学测量位垂直极限位置
	{       -1192,       -32000,        32000},// 光学孵育位抓杯垂直位置
	{           0,       -32000,        32000},// 光学孵育位垂直极限位置
	{       -1200,       -32000,        32000},// 磁珠杯手动区抓杯垂直位置
	{           0,       -32000,        32000},// 磁珠杯手动区垂直极限位置
	{       -1192,       -32000,        32000},// 磁珠法测量位抓杯垂直位置
	{           0,       -32000,        32000},// 磁珠法测量位垂直极限位置
	{       -1208,       -32000,        32000},// 调度盘4#抓杯垂直位置
	{           0,       -32000,        32000},// 调度盘4#垂直极限位置
	{         436,       -32000,        32000},// 配合样本针垂直位置
	{           0,       -32000,        32000},// 配合样本针垂直极限位置
	{         436,       -32000,        32000},// 配合试剂针垂直位置
	{           0,       -32000,        32000},// 配合试剂针垂直极限位置
	{         436,       -32000,        32000},// 抛杯位置垂直位置
	{           0,       -32000,        32000},// 抛杯位置垂直极限位置
	{      -32000,       -32000,            0},// X轴负向极限位置
	{       36000,            0,        36000},// X轴正向极限位置
	{         200,        -3200,         3200},// X轴初始位置
	{      -32000,       -32000,            0},// Y轴负向极限位置
	{       32000,            0,        32000},// Y轴正向极限位置
	{         200,        -3200,         3200},// Y轴初始位置
	{       -1024,        -3200,         3200},// 抓杯准备位置Y轴相对距离
	{        -848,        -3200,         3200},// 抛杯完成位置Y轴相对距离
	{           0,            0,            0},// 校正码齿1位置-X轴
	{           0,            0,            0},// 校正码齿2位置-X轴
	{        -888,       -32000,        32000},// 调度盘4#-X轴
	{       -8416,       -32000,        32000},// 调度盘4#-Y轴
	{        7511,       -32000,        32000},// 配合样本针加样-X轴
	{       -8095,       -32000,        32000},// 配合样本针加样-Y轴
	{       21632,       -32000,        32000},// 配合试剂针加样-X轴
	{       -7903,       -32000,        32000},// 配合试剂针加样-Y轴
	{       33704,       -32000,        50000},// 抛杯位1-X轴
	{       -3440,       -32000,        32000},// 抛杯位1-Y轴
	{       35576,       -32000,        50000},// 抛杯位2-X轴
	{         872,       -32000,        32000},// 抛杯位2-Y轴
	{       -1280,       -32000,        32000},// 磁珠法测量位置51-X轴
	{       -2304,       -32000,        32000},// 磁珠法测量位置51-Y轴
	{       27656,       -32000,        32000},// 光学测量位置1-X轴
	{       -4912,       -32000,        32000},// 光学测量位置1-Y轴
	{       11416,       -32000,        32000},// 光学测量位置12-X轴
	{       -4848,       -32000,        32000},// 光学测量位置12-Y轴
	{        1112,       -32000,        32000},// 光学孵育位21-X轴
	{       -5352,       -32000,        32000},// 光学孵育位21-Y轴
	{        8464,       -32000,        32000},// 光学孵育位26-X轴
	{       -5400,       -32000,        32000},// 光学孵育位26-Y轴
	{        8408,       -32000,        32000},// 光学孵育位38-X轴
	{         560,       -32000,        32000},// 光学孵育位38-Y轴
	{       11520,       -32000,        32000},// 磁珠杯手动放杯61--X轴
	{         560,       -32000,        32000},// 磁珠杯手动放杯61--Y轴
	{       27792,       -32000,        32000},// 磁珠杯手动放杯72--X轴
	{         384,       -32000,        32000},// 磁珠杯手动放杯72--Y轴
	{         244,            0,         1000},// 混匀强度1-光学法-弱
	{         274,            0,         1000},// 混匀强度2-光学法-中弱
	{         304,            0,         1000},// 混匀强度3-光学法-中
	{         334,            0,         1000},// 混匀强度4-光学法-中强
	{         364,            0,         1000},// 混匀强度5-光学法-强
	{         244,            0,         1000},// 混匀强度6-磁珠法-弱
	{         274,            0,         1000},// 混匀强度7-磁珠法-中弱
	{         304,            0,         1000},// 混匀强度8-磁珠法-中
	{         334,            0,         1000},// 混匀强度9-磁珠法-中强
	{         364,            0,         1000},// 混匀强度10-磁珠法-强
	{           0,            0,            0},// 光学混匀时间-样本混合液
	{           0,            0,            0},// 光学混匀时间-中间试剂
	{           0,            0,            0},// 光学混匀时间-触发试剂
	{           0,            0,            0},// 磁珠混匀时间-样本混合液
	{           0,            0,            0},// 磁珠混匀时间-中间试剂
	{           0,            0,            0},// 磁珠混匀时间-触发试剂
	{           0,            0,            0},// 是否开启抓手X轴校正
	{          96,            0,          100},// 混匀速度加速台阶
	{          96,            0,          100},// 混匀速度减速台阶
	{       -1216,       -32000,        32000},// 光学测量位抓杯垂直位置12
	{       -1168,       -32000,        32000},// 光学孵育位抓杯垂直位置26
	{       -1192,       -32000,        32000},// 光学孵育位抓杯垂直位置38
	{       -1168,       -32000,        32000},// 磁珠杯手动区抓杯垂直位置72
};
